Repository: dlai-sd/crop-ai
Catalog: mobile/lib/l10n/app_*.arb
Languages: hi, ta

# appName
source: Agri-Pulse
hi: कृषि-पल्स

# appTagline
source: Farm to Table Intelligence
hi: खेत से टेबल तक की बुद्धिमत्ता
ta: விவசாயிக்கான AI

source: Language
hi: भाषा
ta: மொழி

source: Login
hi: लॉगिन
ta: உள்நுழைக

source: Register
hi: पंजीकरण करें
ta: பதிவுபெறு

# welcome
source: Welcome to Agri-Pulse
hi: कृषि-पल्स में आपका स्वागत है
ta: Agri-Pulseக்கு வரவேற்கிறோம்

source: Email
hi: ईमेल
ta: மின்னஞ்சல்

source: Password
hi: पासवर्ड
ta: கடவுச்சொல்

source: Phone Number
hi: फोन नंबर
ta: தொலைபேசி எண்

source: Logout
hi: लॉग आउट
ta: வெளியேறு

# decisionBoard
source: AI Decision Board
hi: AI निर्णय बोर्ड
ta: AI முடிவு பலகை

# decisionBoardDesc
source: Get expert advice before planting
hi: रोपण से पहले विशेषज्ञ सलाह प्राप्त करें
ta: நடவு செய்வதற்கு முன் நிபுணர் ஆலோசனை பெறுங்கள்

source: Select Crop
hi: फसल चुनें
ta: பயிரைத் தேர்வுசெய்யுங்கள்

# selectStage
source: Growth Stage
hi: वृद्धि का चरण
ta: வளர்ச்சிப் பর்যாயம்

# getAdvice
source: Get AI Advice
hi: AI सलाह प्राप्त करें
ta: AI ஆலோசனை பெறு

source: Verdict
hi: निर्णय
ta: தீர்ப்பு

# goAhead
source: Go Ahead! Good conditions
hi: आगे बढ़ें! अच्छी परिस्थितियाँ
ta: முன்னேறு! நல்ல நிலைமைகள்

# mustAvoid
source: Must Avoid. High risk.
hi: बचें। उच्च जोखिम।
ta: தவிர்க்கவும். அதிக ஆபத்து.

# proceed
source: Proceed with Caution
hi: सावधानी के साथ आगे बढ़ें
ta: எச்சரிக்கையுடன் செல்லவும்

source: Living Map
hi: जीवंत नक्शा
ta: வாழும் வரைபடம்

source: My Crops
hi: मेरी फसलें
ta: என் பயிர்கள்

source: Services
hi: सेवाएं
ta: சேவைகள்

source: Buy Fresh
hi: ताजा खरीदें
ta: புதியதை வாங்கு

# searchLocation
source: Search location or crop...
hi: स्थान या फसल खोजें...
ta: இடம் அல்லது பயிரைத் தேடு...

# myCropsTitle
source: My Crops
hi: मेरी फसलें
ta: என் பயிர்கள்

# pestRisk
source: Pest Risk: {percentage}%
hi: कीट जोखिम: {percentage}%
ta: பூச்சி ஆபத்து: {percentage}%

# daysToHarvest
source: {days} days to harvest
hi: कटाई में {days} दिन
ta: அறுவடைக்கு {days} நாட்கள்

# soilHealth
source: Soil Health: {score}%
hi: मिट्टी का स्वास्थ्य: {score}%
ta: மண் ஆரோக்கியம்: {score}%

source: Weather
hi: मौसम
ta: வானிலை

# humidity
source: Humidity: {humidity}%
hi: आर्द्रता: {humidity}%
ta: ஈரப்பதம்: {humidity}%

# servicesTitle
source: Find Services
hi: सेवाएं खोजें
ta: சேவைகளைக் கண்டறியும்

source: Urgent
hi: तुरंत
ta: அவசரம்

source: Predicted
hi: अनुमानित
ta: முன்னறிவித்தது

# mechanicNeed
source: Tractor repair needed
hi: ट्रैक्टर की मरम्मत की आवश्यकता
ta: ட்ராக்டர் பழுதுபார்ப்பு தேவை

# transportNeed
source: Transport available soon
hi: परिवहन शीघ्र उपलब्ध
ta: போக்குவரத்து விரைவில் கிடைக்கும்

# pestControl
source: Pest control expert nearby
hi: कीट नियंत्रण विशेषज्ञ पास में
ta: பூச்சி கட்டுப்பாட்டு நிபுணர் அருகில்

source: Call Now
hi: अभी कॉल करें
ta: இப்போது அழைக்கவும்

source: View Details
hi: विवरण देखें
ta: விவரங்களைக் காண்பிக்கவும்

# buyFreshTitle
source: Buy Fresh Produce
hi: ताजा उपज खरीदें
ta: புதிய விளைபொருளை வாங்கு

# harvestedHours
source: Harvested {hours}h ago
hi: {hours}h पहले काटी गई
ta: {hours}h முன் அறுவடை செய்யப்பட்டது

# bioVitality
source: Bio-Vitality Index
hi: जैव-जीवंतता सूचकांक
ta: உயிரியல் சக்தி குறியீட்டு

source: Farm Story
hi: खेत की कहानी
ta: விவசாய கதை

source: View Farm
hi: खेत देखें
ta: விவசாயத்தைக் காண்பிக்கவும்

source: Add to Cart
hi: कार्ट में जोड़ें
ta: கார்ட்டில் சேர்க்கவும்

# pricePerKg
source: ₹{price}/kg
hi: ₹{price}/किग्रा
ta: ₹{price}/கி.கி

# magicSnap
source: Magic Snap - Claim Your Land
hi: जादुई स्नैप - अपनी जमीन को दावा करें
ta: மாயமான ஸ்னாப் - உங்கள் நிலத்தை பெறவும்

# centerCrosshair
source: Center the crosshair on your field
hi: क्रॉसहेयर को अपने खेत पर केंद्रित करें
ta: குறுக்குகோடை உங்கள் வயலின் மீது மையப்படுத்தவும்

# autoDetecting
source: Auto-detecting field boundary...
hi: खेत की सीमा स्वचालित रूप से पहचान रहे हैं...
ta: வயல் எல்லையை தானாக கண்டறிந்து வருகிறது...

source: Boundary detected!
hi: सीमा पहचानी गई!
ta: எல்லை கண்டறியப்பட்டது!

# acreage
source: {acres} acres
hi: {acres} एकड़
ta: {acres} ஏக்கர்

source: Confirm Boundary
hi: सीमा की पुष्टि करें
ta: எல்லையை உறுதிசெய்து

# retake
source: Retake Photo
hi: फिर से लें
ta: மீண்டும் எடுக்கவும்

# chat
source: Messages
hi: संदेश
ta: செய்திகள்

# messageHint
source: Type a message...
hi: संदेश लिखें...
ta: செய்தி தட்டச்சு செய்யவும்...

source: Send
hi: भेजें
ta: அனுப்பு

source: Accept Bid
hi: बोली स्वीकार करें
ta: பணியை ஏற்றுக்கொள்ளு

source: Share Location
hi: स्थान साझा करें
ta: இடத்தைப் பகிர்ந்து கொள்ளு

source: View Profile
hi: प्रोफाइल देखें
ta: சுயவிவரத்தைக் காண்பிக்கவும்

# rejectBid
source: Reject
hi: अस्वीकार करें
ta: நிராகரி

source: Loading...
hi: लोड हो रहा है...
ta: ஏற்றுகிறது...

# error
source: Error occurred
hi: त्रुटि हुई
ta: பிழை ஏற்பட்டது

source: Retry
hi: फिर से प्रयास करें
ta: மீண்டும் முயற்சி செய்யவும்

source: Success!
hi: सफल!
ta: வெற்றி!

# noData
source: No data available
hi: कोई डेटा उपलब्ध नहीं
ta: கிடைக்கும் தரவு இல்லை

source: View More
hi: अधिक देखें
ta: மேலும் காண்பிக்கவும்

source: Close
hi: बंद करें
ta: மூடு
